app/views/portfolios/show.html.erb

SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = $1  [["portfolio_id", 1]]
---
      <h3>Technologies used</h3>
      <% @portfolio_item.technologies.each do |t| %>