app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.page(params[:page]).per(5)
---
SELECT  "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["body", "testafm;al,flae,f'e"], ["created_at", "2018-10-17 05:13:47.665525"], ["updated_at", "2018-10-17 05:13:47.665525"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3