app/controllers/portfolios_controller.rb

  def index
    @portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

  def create
    @portfolio_item = Portfolio.new(portfolio_parms)

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @portfolio_item.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 3]]

  def set_portfolio_items
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]