app/controllers/portfolios_controller.rb

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @portfolio_item = Portfolio.find(params[:id])